app/controllers/book_comments_controller.rb

  def destroy
    @bookcomment = BookComment.find(params[:book_id])
    @bookcomment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 9]]