app/controllers/post_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-12-02 05:28:58.450933"], ["updated_at", "2020-12-02 05:28:58.450933"]]

  def destroy
    @postcomment = PostComment.find(params[:book_id])
    @postcomment.destroy
---
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" IS NULL AND "post_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]