app/controllers/users_controller.rb

UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "8dd579823f73c74d5cea2730c41082d4a47252031ffc64fc6214377dc595"], ["updated_at", "2020-12-02 09:41:55.191980"], ["id", 3]]
---
  def update
    if @user.update(user_params)